printf '\e[32m==================================\n[1.] パッケージインストール開始\n==================================\e[0m\n'
pnpm install
printf '\e[32m==================================\n[1.]パッケージインストール完了\n==================================\e[0m\n'

printf '\n\e[32m==================================\n[2.]ビルド開始\n==================================\e[0m\n'
pnpm build
printf '\n\e[32m==================================\n[2.]ビルド完了\n==================================\e[0m\n'


printf '\n\e[32m==================================\n[3.]起動スクリプトの生成開始\n==================================\e[0m\n'
cat << 'EOF' > .next/standalone/run.sh
#!/bin/bash

[ ! -d '/tmp/cache' ] && mkdir -p /tmp/cache

HOSTNAME=0.0.0.0 exec node server.js
EOF

chmod +x .next/standalone/run.sh
printf '\n\e[32m==================================\n[3.]起動スクリプトの生成完了\n==================================\e[0m\n'


printf '\n\e[32m==================================\n[4.]アーティファクトをzipに圧縮開始\n==================================\e[0m\n'

zip -r dist.zip .next/standalone

printf '\n\e[32m==================================\n[4.]アーティファクトをzipに圧縮完了\n==================================\e[0m\n'
